## 正しい言葉かどうかに気を配る

当たり前に思えるかもしれませんが、UXライターとしてお仕事をする上での第一歩だと思います。

何気なく使われている言葉や記号にに対し、「この使い方でよかったっけ？」という疑問を持てること。けっこう大切だなぁと感じています。

例えば...

- 設定することができます→設定できます
    - 「することができる」は冗長
- 変更のない値 vs 変更がない値
    - 「ガノ交替」と呼ばれる論点で、どちらも正しい

『日本語スタイルガイド 第3版』を読むと、こうしたちょっとした違和感に気づけるようになると思います。

## ガイドラインを確認する

こちらも初歩的な教訓。ガイドラインがあれば、ガイドラインに沿った文章かをチェックします。

幸い、弊社には文言に関するガイドラインがあるので、ライター間で揺れの少ない文言を作れます。本当にありがたい。

もし、社内にガイドラインがないなら、まずは自分だけの用字用語集や文言事例集を作ってみるのもアリだと思います。

用字用語や事例が増えてきたら、社内に共有してみる。社内のメンバーが興味を持って、メンテナンスに参加してくれる。

そんな感じでガイドラインに育っていくのかなぁと思っています。

## 「ひと言め」を大切にする

何か新しい機能を開発するとき、その機能には必ず「仮の名前」が付けられます。

コードネームかもしれないし、とりあえずつけた機能名かもしれないし...

とにかく、開発メンバー全員がコミュニケーションをとる上で、機能に対してなんらかの名前は必要です。

私の考えですが、そんな「ひと言め」の名前は、開発中の文言検討に大きな影響を及ぼします。

例えば...

「システム上のデータをCSVでダウンロードできる機能」が、ユーザーから求められ、開発が決まったとします。

開発メンバーはとりあえず「CSVエクスポート機能」と、その機能を呼ぶことにしました。

仕様検討が進むたび、メンバーの中で「CSVエクスポート機能」という名前が定着していきます。

ある段階で、「そろそろ正式名称を決めようか」という話になり、UXライターが検討を始めます。

『うーん、「エクスポート」はITに詳しくない人には馴染みが少ないから、「書き出し」にしよう。CSVはそのままでいいかな』

こうして、「CSV書き出し機能」は無事リリースされました。

「ファイルで保存機能」の方が、ユーザーにとってわかりやすい命名だったかもしれないのに。

...こんな感じで、最初に「とりあえず」で命名した「CSVエクスポート機能」は、その後の概念・文言の検討に大きな影響を与えます。

もちろん、ユーザーの声を聞き、概念を定義し、わかりやすい文言を作るのがUXライターの仕事ではあります。

ただ、一度頭に入った名前が規定する概念から脱出するのは、相応のエネルギーが必要ですし、もともと名前がなければ不要なエネルギーでもあります。

UXライターの仕事を楽にするために、「ひと言め」をおさえにいくのが大切だと感じています。

同じような教訓に「自分が書いた文章は、一晩寝かせて読み返した方がいい」というものがあります。記憶は怖い...。

## 新規ユーザーと既存ユーザーがいることを意識する

- 既存ユーザーなら「あーあれね」となる文言でも、新規ユーザーだと「はにゃ？」となる場合がある
- 「現金」はとてもいい例


## ユーザーがどういう言葉で概念を認知しているのかを調べる

- 問い合わせを漁ったり
- ユーザーに近い社内の担当者にヒアリングしたり



## いろんな角度から言葉を眺める



## なるべく操作を限定する



## 変更の影響範囲を意識する

- ちょっとしたボタンの文言変更でも、処理の成功ダイアログやエラー文言、ヘルプページまで、広範囲に影響することがある
